In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

### pandas的数据结构介绍

#### Series

In [2]:
obj = Series([2, 8, 5])

In [3]:
obj

0    2
1    8
2    5
dtype: int64

In [4]:
obj.values

array([2, 8, 5])

In [5]:
obj.index

RangeIndex(start=0, stop=3, step=1)

In [6]:
obj2 = Series([1, 8, 6], index=["x", "y", "z"])

In [7]:
obj2

x    1
y    8
z    6
dtype: int64

In [8]:
obj2.index

Index(['x', 'y', 'z'], dtype='object')

In [9]:
obj2["z"]

6

In [10]:
obj2

x    1
y    8
z    6
dtype: int64

In [11]:
obj2[obj2 > 1]

y    8
z    6
dtype: int64

In [12]:
obj2 * 2

x     2
y    16
z    12
dtype: int64

In [13]:
np.exp(obj2)

x       2.718282
y    2980.957987
z     403.428793
dtype: float64

In [14]:
# 可以将Series看成一个定长的有序字典，因为它是索引值到数据值的一个映射。
"x" in obj2

True

In [15]:
"k" in obj2

False

In [16]:
# 通过字典创建Series
company_dict = {"GOOG":"谷歌", "APPL":"苹果", "NFLX":"奈飞"}
obj3 = Series(company_dict)

In [17]:
obj3

APPL    苹果
GOOG    谷歌
NFLX    奈飞
dtype: object

In [18]:
# 有序排列
company_index_list = ["GOOG","BABA", "TSLA", "NFLX", "APPL"]
obj4 = Series(company_dict, index=company_index_list)
obj4

GOOG     谷歌
BABA    NaN
TSLA    NaN
NFLX     奈飞
APPL     苹果
dtype: object

In [19]:
# pandas的isnull和notnull函数可用于检测缺失数据
pd.isnull(obj4)

GOOG    False
BABA     True
TSLA     True
NFLX    False
APPL    False
dtype: bool

In [20]:
pd.notnull(obj4)

GOOG     True
BABA    False
TSLA    False
NFLX     True
APPL     True
dtype: bool

In [21]:
# Series类似的实例方法
obj4.isnull()

GOOG    False
BABA     True
TSLA     True
NFLX    False
APPL    False
dtype: bool

In [22]:
# 对于许多应用而言，Series最重要的一个功能是：它在算术运算中会自动对齐不同索引的数据。
obj3

APPL    苹果
GOOG    谷歌
NFLX    奈飞
dtype: object

In [23]:
obj4

GOOG     谷歌
BABA    NaN
TSLA    NaN
NFLX     奈飞
APPL     苹果
dtype: object

In [24]:
obj3 + obj4

APPL    苹果苹果
BABA     NaN
GOOG    谷歌谷歌
NFLX    奈飞奈飞
TSLA     NaN
dtype: object

In [25]:
# Series对象本身及其索引都有一个name属性，该属性跟pandas其他的关键功能关系非常密切
obj4.name = "公司名称"

In [26]:
obj4.index.name = "股票代码"

In [27]:
obj4

股票代码
GOOG     谷歌
BABA    NaN
TSLA    NaN
NFLX     奈飞
APPL     苹果
Name: 公司名称, dtype: object

In [28]:
# 通过赋值的方式修改Series的索引
obj4.index = ["GOOG", "AMZN", "HK0700", "NFLX", "APPL"]

In [29]:
obj4

GOOG       谷歌
AMZN      NaN
HK0700    NaN
NFLX       奈飞
APPL       苹果
Name: 公司名称, dtype: object

#### DataFrame

In [30]:
# 构建DataFrame
company_data = {"name":["谷歌","奈飞"], "stock_no":["GOOG", "NFLX"]}
company_data_frame= DataFrame(company_data)

In [31]:
company_data_frame

  name stock_no
0   谷歌     GOOG
1   奈飞     NFLX

In [32]:
# 指定列序列
DataFrame(company_data, columns=["stock_no", "name"])

  stock_no name
0     GOOG   谷歌
1     NFLX   奈飞

In [33]:
# 列在数据中找不到，就会产生NA值
company_data_frame2 = DataFrame(company_data, columns=["stock_no", "name", "address"],
                                index=["one", "two"])

In [34]:
company_data_frame2

    stock_no name address
one     GOOG   谷歌     NaN
two     NFLX   奈飞     NaN

In [35]:
company_data_frame2.columns

Index(['stock_no', 'name', 'address'], dtype='object')

In [36]:
company_data_frame2.name

one    谷歌
two    奈飞
Name: name, dtype: object

In [37]:
company_data_frame2['name']

one    谷歌
two    奈飞
Name: name, dtype: object

In [38]:
company_data_frame2.ix['two']

/SoftWare/python/python3-data-analysis-F15e879i/lib/python3.5/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

stock_no    NFLX
name          奈飞
address      NaN
Name: two, dtype: object

In [39]:
# 通过赋值的方式修改列
company_data_frame2.address = "美国"

In [40]:
company_data_frame2

    stock_no name address
one     GOOG   谷歌      美国
two     NFLX   奈飞      美国

In [41]:
# 为不存在的列赋值会创建一个新列
company_data_frame2["is_usd"] = company_data_frame2.address == "美国"

In [42]:
company_data_frame2

    stock_no name address  is_usd
one     GOOG   谷歌      美国    True
two     NFLX   奈飞      美国    True

In [43]:
# 删除列
del company_data_frame2["is_usd"]

In [44]:
company_data_frame2

    stock_no name address
one     GOOG   谷歌      美国
two     NFLX   奈飞      美国

In [45]:
# 嵌套字典（字典的字典）
company_data = {"name":{"one":"谷歌", "two":"奈飞"},
                   "stock_no":{"one":"GOOG", "two":"NFLX"},
                   "address":{"one":"美国", "two":"美国"},
               }

In [46]:
company_data_frame3 = DataFrame(company_data)
company_data_frame3

    address name stock_no
one      美国   谷歌     GOOG
two      美国   奈飞     NFLX

In [47]:
company_data_frame3.T

           one   two
address     美国    美国
name        谷歌    奈飞
stock_no  GOOG  NFLX

In [48]:
#DataFrame(company_data, index=["one", "two"])

In [49]:
company_data_frame3.index.name = "记录号"

In [50]:
company_data_frame3.columns.name = "字段"

In [51]:
company_data_frame3

字段  address name stock_no
记录号
one      美国   谷歌     GOOG
two      美国   奈飞     NFLX

In [52]:
# 索引对象
obj = Series(range(3), index=["x", "y", "z"])

In [53]:
index = obj.index

In [54]:
index

Index(['x', 'y', 'z'], dtype='object')

In [55]:
index[1:]

Index(['y', 'z'], dtype='object')

In [56]:
# Index对象是不可修改的（immutable）
# 不可修改性非常重要，因为这样才能使Index对象在多个数据结构之间安全共享
# index["x"] = "g"

### 基本功能

#### 1.重新索引

In [57]:
company_obj = Series(["google", "alibaba", "apple"], index=["GOOG", "BABA", "APPL"])

In [58]:
company_obj

GOOG     google
BABA    alibaba
APPL      apple
dtype: object

In [59]:
# 根据新索引进行重新排序
company_obj2= company_obj.reindex(["APPL", "GOOG", "BABA", "NFLX"])

In [60]:
company_obj2

APPL      apple
GOOG     google
BABA    alibaba
NFLX        NaN
dtype: object

In [61]:
# 对于时间序列这样的有序数据，重新索引时可能需要做一些插值处理
color_obj = Series(["blue", "purple", "yellow"], index=[0, 2, 4])

In [62]:
color_obj

0      blue
2    purple
4    yellow
dtype: object

In [63]:
color_obj.reindex(range(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [64]:
# 对于DataFrame，reindex可以修改（行）索引、列，或者连个都修改。
company_frame = DataFrame(np.arange(9).reshape((3, 3)), index=["GOOG", "BABA", "APPL"],
                          columns=["谷歌", "阿里巴巴", "苹果"]
                         )

In [65]:
company_frame

      谷歌  阿里巴巴  苹果
GOOG   0     1   2
BABA   3     4   5
APPL   6     7   8

In [66]:
company_frame2 = company_frame.reindex(["BABA", "APPL", "GOOG"])

In [67]:
company_frame2

      谷歌  阿里巴巴  苹果
BABA   3     4   5
APPL   6     7   8
GOOG   0     1   2

In [68]:
company_list = ["谷歌", "苹果", "阿里巴巴"]

In [69]:
company_frame.reindex(columns=company_list)

      谷歌  苹果  阿里巴巴
GOOG   0   2     1
BABA   3   5     4
APPL   6   8     7

In [70]:
# 可以同时对行和列进行重新索引
company_frame.reindex(index=["BABA", "APPL", "GOOG"],
                        columns=company_list)

      谷歌  苹果  阿里巴巴
BABA   3   5     4
APPL   6   8     7
GOOG   0   2     1

In [71]:
# 利用ix的标签索引功能，重新索引任务可以变得更简洁
company_frame.ix[["APPL", "BABA", "GOOG"], company_list]

/SoftWare/python/python3-data-analysis-F15e879i/lib/python3.5/site-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

      谷歌  苹果  阿里巴巴
APPL   6   8     7
BABA   3   5     4
GOOG   0   2     1

#### 2.丢弃指定轴上的项

In [72]:
obj = Series(np.arange(3.), index=["x", "y", "z"])

In [73]:
obj

x    0.0
y    1.0
z    2.0
dtype: float64

In [74]:
new_obj = obj.drop("y")

In [75]:
new_obj

x    0.0
z    2.0
dtype: float64

In [76]:
# 输出任意轴上的索引值
new_obj = obj.drop(["x", "z"])

In [77]:
new_obj

y    1.0
dtype: float64

#### 3.索引、选取和过滤

In [78]:
obj = Series(np.arange(3.), index=["x", "y", "z"])

In [79]:
obj

x    0.0
y    1.0
z    2.0
dtype: float64

In [80]:
obj["y"]

1.0

In [81]:
obj[0]

0.0

In [82]:
obj[1:3]

y    1.0
z    2.0
dtype: float64

In [83]:
obj[["x", "y"]]

x    0.0
y    1.0
dtype: float64

In [84]:
obj[[1, 2]]

y    1.0
z    2.0
dtype: float64

In [85]:
obj[obj < 2]

x    0.0
y    1.0
dtype: float64

In [86]:
# 对DataFrame进行索引其实就是获取一个或多个实例
data = DataFrame(np.arange(16).reshape((4, 4)),
                index=["Google", "Apple", "Amazon", "Alibaba"],
                columns=["one", "two", "three", "four"])

In [87]:
data

         one  two  three  four
Google     0    1      2     3
Apple      4    5      6     7
Amazon     8    9     10    11
Alibaba   12   13     14    15

In [88]:
data["two"]

Google      1
Apple       5
Amazon      9
Alibaba    13
Name: two, dtype: int64

In [89]:
data[["three", "one"]]

         three  one
Google       2    0
Apple        6    4
Amazon      10    8
Alibaba     14   12

In [90]:
# 通过切片或布尔型数组选取行
data[:2]

        one  two  three  four
Google    0    1      2     3
Apple     4    5      6     7

In [91]:
data[data["three"] > 5]

         one  two  three  four
Apple      4    5      6     7
Amazon     8    9     10    11
Alibaba   12   13     14    15

In [92]:
# 通过布尔型DataFrame进行索引
# DataFrame在语法上更像ndarray
data < 5

           one    two  three   four
Google    True   True   True   True
Apple     True  False  False  False
Amazon   False  False  False  False
Alibaba  False  False  False  False

In [93]:
data[data < 5] = 0

In [94]:
data

         one  two  three  four
Google     0    0      0     0
Apple      0    5      6     7
Amazon     8    9     10    11
Alibaba   12   13     14    15

In [95]:
# 使用索引字段ix在DataFrame的行上进行标签索引
data.ix["Apple", ["two", "three"]]

/SoftWare/python/python3-data-analysis-F15e879i/lib/python3.5/site-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

two      5
three    6
Name: Apple, dtype: int64

In [96]:
data.ix[["Google", "Apple"], [3, 0, 1]]

/SoftWare/python/python3-data-analysis-F15e879i/lib/python3.5/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

        four  one  two
Google     0    0    0
Apple      7    0    5

In [97]:
data.ix[2]

/SoftWare/python/python3-data-analysis-F15e879i/lib/python3.5/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

one       8
two       9
three    10
four     11
Name: Amazon, dtype: int64

In [98]:
data.ix[:"Amazon", "two"]

/SoftWare/python/python3-data-analysis-F15e879i/lib/python3.5/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

Google    0
Apple     5
Amazon    9
Name: two, dtype: int64

In [99]:
data.ix[data.three > 5, :3]

/SoftWare/python/python3-data-analysis-F15e879i/lib/python3.5/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

         one  two  three
Apple      0    5      6
Amazon     8    9     10
Alibaba   12   13     14

#### 4.算术运算和数据对齐

In [100]:
s1 = Series([1, 3, 5, 7], index=['a', 'b', 'c', 'd'])

In [101]:
s2 = Series([2, 1, 4, 6, 4, 3], index=['a', 'b', 'c', 'd', 'e', 'f'])

In [102]:
s1

a    1
b    3
c    5
d    7
dtype: int64

In [103]:
s2

a    2
b    1
c    4
d    6
e    4
f    3
dtype: int64

In [104]:
# 自动的数据对齐操作在不重叠的索引出引入了NA值
# 缺失值会在算术过程中传播
s1 + s2

a     3.0
b     4.0
c     9.0
d    13.0
e     NaN
f     NaN
dtype: float64

In [105]:
# 对于DataFrame，对齐操作会同时在行和列上
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list("abc"),
               index=list("xyz"))

In [106]:
df1

     a    b    c
x  0.0  1.0  2.0
y  3.0  4.0  5.0
z  6.0  7.0  8.0

In [107]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bcd"),
               index=list("axzh"))

In [108]:
df2

     b     c     d
a  0.0   1.0   2.0
x  3.0   4.0   5.0
z  6.0   7.0   8.0
h  9.0  10.0  11.0

In [109]:
# 相加，返回新的DataFrame，其索引和列为原来那两个DataFrame的并集
df1 + df2

    a     b     c   d
a NaN   NaN   NaN NaN
h NaN   NaN   NaN NaN
x NaN   4.0   6.0 NaN
y NaN   NaN   NaN NaN
z NaN  13.0  15.0 NaN

#### 5.在算术方法中填充值

In [110]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list("abcd"))

In [111]:
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list("abcde"))

In [112]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [113]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [114]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [115]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [116]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### 6.DataFrame和Series之间的运算

In [117]:
arr = np.arange(12.).reshape((3, 4))

In [118]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [119]:
arr[0]

array([0., 1., 2., 3.])

In [120]:
# 广播（broadcasting）
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [121]:
# DataFrame和Series之间的运算
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                 index=["Google", "Apple", "Amazon", "Alibaba"])

In [122]:
series = frame.ix[0]

/SoftWare/python/python3-data-analysis-F15e879i/lib/python3.5/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [123]:
frame

           b     d     e
Google   0.0   1.0   2.0
Apple    3.0   4.0   5.0
Amazon   6.0   7.0   8.0
Alibaba  9.0  10.0  11.0

In [124]:
series

b    0.0
d    1.0
e    2.0
Name: Google, dtype: float64

In [125]:
frame - series

           b    d    e
Google   0.0  0.0  0.0
Apple    3.0  3.0  3.0
Amazon   6.0  6.0  6.0
Alibaba  9.0  9.0  9.0

In [126]:
series2 = Series(range(3), index=["b", "e", "f"])

In [127]:
frame + series2

           b   d     e   f
Google   0.0 NaN   3.0 NaN
Apple    3.0 NaN   6.0 NaN
Amazon   6.0 NaN   9.0 NaN
Alibaba  9.0 NaN  12.0 NaN

In [128]:
series3 = frame["d"]

In [129]:
frame

           b     d     e
Google   0.0   1.0   2.0
Apple    3.0   4.0   5.0
Amazon   6.0   7.0   8.0
Alibaba  9.0  10.0  11.0

In [130]:
series3

Google      1.0
Apple       4.0
Amazon      7.0
Alibaba    10.0
Name: d, dtype: float64

In [131]:
# 匹配DataFrame的行索引并进行广播
frame.sub(series3, axis=0)

           b    d    e
Google  -1.0  0.0  1.0
Apple   -1.0  0.0  1.0
Amazon  -1.0  0.0  1.0
Alibaba -1.0  0.0  1.0

#### 7.函数应用和映射

In [132]:
frame = DataFrame(np.random.randn(4, 3), columns=list("bde"),
                 index=["Google", "Amazon", "Apple", "Alibaba"])

In [133]:
frame

                b         d         e
Google  -1.188622  0.418207  0.592554
Amazon  -0.215463  0.079518  1.105230
Apple    0.905426  0.272724  0.321562
Alibaba  1.345380  1.768189  0.512693

In [134]:
np.abs(frame)

                b         d         e
Google   1.188622  0.418207  0.592554
Amazon   0.215463  0.079518  1.105230
Apple    0.905426  0.272724  0.321562
Alibaba  1.345380  1.768189  0.512693

In [135]:
f = lambda x : x.max() - x.min()
frame.apply(f)

b    2.534002
d    1.688671
e    0.783668
dtype: float64

In [136]:
frame.apply(f, axis=1)

Google     1.781176
Amazon     1.320693
Apple      0.632702
Alibaba    1.255496
dtype: float64

In [137]:
def f(x):
    return Series([x.min(), x.max()], index=["min", "max"])

In [138]:
frame.apply(f)

            b         d         e
min -1.188622  0.079518  0.321562
max  1.345380  1.768189  1.105230

In [139]:
format = lambda x: "%.2f" % x

In [140]:
frame.applymap(format)

             b     d     e
Google   -1.19  0.42  0.59
Amazon   -0.22  0.08  1.11
Apple     0.91  0.27  0.32
Alibaba   1.35  1.77  0.51

In [141]:
frame["e"].map(format)

Google     0.59
Amazon     1.11
Apple      0.32
Alibaba    0.51
Name: e, dtype: object

#### 8.排序和排名

In [142]:
obj = Series(range(4), index=["d", "a", "b", "c"])

In [143]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [144]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [145]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=["three", "one"],
                 columns=["d", "a", "b", "c"])

In [146]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [147]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [148]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [149]:
frame = DataFrame({"b":[4, 7, -3, 2], 'a':[0, 1, 0, 1]})

In [150]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [151]:
frame.sort_values(by="b")

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [152]:
frame.sort_values(by=["a", "b"])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [153]:
# 默认情况下，rank是通过“为各组分配一个平均排名”的方式破坏平级关系的
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [154]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [155]:
# 根据值在原数据中出现的顺序给出排名
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [156]:
# 按降序进行排名
obj.rank(ascending=False, method="max")

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [157]:
frame = DataFrame({"b":[4.3, 7, -3, 2], "a":[0, 1, 0, 1],
                  "c":[-2, 5, 8, -2.5]})

In [158]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [159]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

#### 9.带有重复值的轴索引

In [160]:
obj = Series(range(5), index=["a", "a", "b", "b", "c"])

In [161]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [162]:
obj.index.is_unique

False

In [163]:
obj["a"]

a    0
a    1
dtype: int64

In [164]:
obj["c"]

4

In [165]:
df = DataFrame(np.random.randn(4, 3), index=["a", "a", "b", "b"])

In [166]:
df

          0         1         2
a  0.702578 -0.905194 -1.301197
a -0.960242 -0.306700 -0.068149
b  0.922114  0.323010  0.159115
b  0.185876 -1.557529  0.456885

In [167]:
df.loc["b"]

          0         1         2
b  0.922114  0.323010  0.159115
b  0.185876 -1.557529  0.456885

### 汇总和计算汇总统计

In [168]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5], 
                [np.nan, np.nan], [0.75, -1.3]],
                index=["a", "b", "c", "d"],
                columns=["one", "two"])

In [169]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [170]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [171]:
# 按行进行求和
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [172]:
df.idxmax()

one    b
two    d
dtype: object

In [173]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [174]:
# 汇总统计
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [175]:
# 对于非数值数据，describe会产生另外一种汇总统计
obj = Series(["a", "a", "b", "c"] * 4)

In [178]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

#### 1.相关系数与协方差

#### 2.唯一值、值计数以及成员资格

In [186]:
obj = Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [187]:
unique = obj.unique()

In [188]:
unique

array(['c', 'a', 'd', 'b'], dtype=object)

In [189]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [190]:
pd.value_counts(obj.values, sort=False)

b    2
a    3
c    3
d    1
dtype: int64

In [191]:
mask = obj.isin(["b", "c"])

In [192]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [193]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [195]:
data = DataFrame({"Qu1":[1, 3, 4, 3, 4],
                  "Qu2":[2, 3, 1, 2, 3],
                  "Qu3":[1, 5, 2, 4, 4],
                 })

In [196]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [197]:
result = data.apply(pd.value_counts).fillna(0)

In [198]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

### 处理缺失数据

In [199]:
company_data = Series(["Google", "Amazon", np.nan, "Alibaba"])

In [200]:
company_data

0     Google
1     Amazon
2        NaN
3    Alibaba
dtype: object

In [201]:
company_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [202]:
# Python内置的None值也会被当做NA处理
company_data[0] = None
company_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

#### 1. 滤除缺失数据

In [203]:
from numpy import nan as NA

In [204]:
data = Series([1, NA, 3.5, NA, 7])

In [205]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [206]:
# 通过布尔型索引进行过滤
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [207]:
# dropna默认丢弃任何含有缺失值的行
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                 [NA, NA, NA], [NA, 6.5, 3.]])

In [208]:
cleaned = data.dropna()

In [209]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [210]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [211]:
# 传入how="all"将只丢弃全为NA的那些行
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [212]:
# 要用这种方式丢弃列，只需传入axis=1即可
data[4] = NA

In [213]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [214]:
data.dropna(axis=1, how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [215]:
# 滤除DataFrame行的问题涉及时间序列数据
df = DataFrame(np.random.randn(7, 3))

In [216]:
df

          0         1         2
0 -0.569895  1.395926 -1.312670
1  0.595035  0.313871  0.260144
2 -0.130166  0.419646 -0.986177
3  0.030555 -0.297543 -1.446689
4  0.553855  0.368499 -0.946853
5  0.100106 -0.960224  1.114440
6  0.775213  0.404960 -1.690296

In [218]:
df.loc[:4, 1] = NA

In [219]:
df.loc[:2, 2] = NA

In [220]:
df

          0         1         2
0 -0.569895       NaN       NaN
1  0.595035       NaN       NaN
2 -0.130166       NaN       NaN
3  0.030555       NaN -1.446689
4  0.553855       NaN -0.946853
5  0.100106 -0.960224  1.114440
6  0.775213  0.404960 -1.690296

In [221]:
df.dropna(thresh=3)

          0         1         2
5  0.100106 -0.960224  1.114440
6  0.775213  0.404960 -1.690296

#### 2.填充缺失数据

In [222]:
df.fillna(0)

          0         1         2
0 -0.569895  0.000000  0.000000
1  0.595035  0.000000  0.000000
2 -0.130166  0.000000  0.000000
3  0.030555  0.000000 -1.446689
4  0.553855  0.000000 -0.946853
5  0.100106 -0.960224  1.114440
6  0.775213  0.404960 -1.690296

In [223]:
# 通过字典调用fillna，实现对不同的列填充不同的值
df.fillna({1:0.5, 3:-1})

          0         1         2
0 -0.569895  0.500000       NaN
1  0.595035  0.500000       NaN
2 -0.130166  0.500000       NaN
3  0.030555  0.500000 -1.446689
4  0.553855  0.500000 -0.946853
5  0.100106 -0.960224  1.114440
6  0.775213  0.404960 -1.690296

In [224]:
# 默认总是返回新对象
_ = df.fillna(0, inplace=True)

In [225]:
df

          0         1         2
0 -0.569895  0.000000  0.000000
1  0.595035  0.000000  0.000000
2 -0.130166  0.000000  0.000000
3  0.030555  0.000000 -1.446689
4  0.553855  0.000000 -0.946853
5  0.100106 -0.960224  1.114440
6  0.775213  0.404960 -1.690296

In [226]:
# 对reindex有效的那些插值方法也可用于fillna
df = DataFrame(np.random.randn(6, 3))

In [227]:
df.loc[2:, 1] = NA
df.loc[4:, 2] = NA

In [228]:
df

          0         1         2
0  1.504979  0.347129  1.667190
1  0.816096 -1.972240  0.485355
2 -0.378669       NaN -0.661394
3  1.716675       NaN -0.602695
4  0.295076       NaN       NaN
5  0.745068       NaN       NaN

In [229]:
df.fillna(method="ffill")

          0         1         2
0  1.504979  0.347129  1.667190
1  0.816096 -1.972240  0.485355
2 -0.378669 -1.972240 -0.661394
3  1.716675 -1.972240 -0.602695
4  0.295076 -1.972240 -0.602695
5  0.745068 -1.972240 -0.602695

In [230]:
df.fillna(method="ffill", limit=2)

          0         1         2
0  1.504979  0.347129  1.667190
1  0.816096 -1.972240  0.485355
2 -0.378669 -1.972240 -0.661394
3  1.716675 -1.972240 -0.602695
4  0.295076       NaN -0.602695
5  0.745068       NaN -0.602695

In [232]:
# 可以利用fillna实现许多别的功能
data = Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [233]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### 层次化索引

In [234]:
data = Series(np.random.randn(10), 
             index=[["a", "a", "a", "b", "b", "b", "c", "c", "d", "d"],
                   [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [235]:
data

a  1    0.099172
   2   -0.619998
   3    0.542108
b  1    1.366763
   2    0.836186
   3   -0.854526
c  1    0.259055
   2    0.233162
d  2    1.503346
   3    0.099726
dtype: float64

In [236]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [237]:
data["b"]

1    1.366763
2    0.836186
3   -0.854526
dtype: float64

In [238]:
data["b":"c"]

b  1    1.366763
   2    0.836186
   3   -0.854526
c  1    0.259055
   2    0.233162
dtype: float64

In [239]:
data.loc[["b", "d"]]

b  1    1.366763
   2    0.836186
   3   -0.854526
d  2    1.503346
   3    0.099726
dtype: float64

In [240]:
data[:, 2]

a   -0.619998
b    0.836186
c    0.233162
d    1.503346
dtype: float64

In [241]:
# 层次化索引在数据重塑和基于分组的操作（如透视表生成）中扮演着重要的角色
# 通过unstack方法重新安排到一个DataFrame中
data.unstack()

          1         2         3
a  0.099172 -0.619998  0.542108
b  1.366763  0.836186 -0.854526
c  0.259055  0.233162       NaN
d       NaN  1.503346  0.099726

In [242]:
# unstack的逆运算是stack
data.unstack().stack()

a  1    0.099172
   2   -0.619998
   3    0.542108
b  1    1.366763
   2    0.836186
   3   -0.854526
c  1    0.259055
   2    0.233162
d  2    1.503346
   3    0.099726
dtype: float64

In [249]:
# 对于一个DataFrame，每条轴都可以有分层索引
frame = DataFrame(np.arange(12).reshape((4, 3)),
                 index=[["a", "a", "b", "b"], [1, 2, 1, 2]],
                 columns=[["Ohio", "Ohio", "Colorado"],
                        ["Green", "Red", "Green"]])

In [250]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [251]:
frame.index.names = ["key1", "key2"]

In [252]:
frame.columns.names = ["state", "color"]

In [253]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [254]:
frame["Ohio"]

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

#### 1.重排分级顺序

In [257]:
# 有时，你需要重新调整某条轴上各级别的顺序，或者根据指定级别上的值对数据进行排序。
# swaplevel接收两个级别编号或名称，并返回一个互换了级别的新对象（但数据不会发生变化）
frame.swaplevel("key1", "key2")

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [259]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [260]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

#### 2.根据级别汇总统计

In [262]:
# 许多对DataFrame和Series的描述和汇总统计都有一个level选项，它用于指定在某条轴上求和的级别。
frame.sum(level="key2")

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [263]:
frame.sum(level="color", axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

#### 3.使用DataFrame的列

In [265]:
# 将DataFrame的一个或多个列当做行索引来用，或者可能希望将行索引变成DataFrame的列。
frame = DataFrame({"a":range(7), "b":range(7, 0, -1), 
                  "c":["one", "one", "one", "two", "two", "two", "two"],
                  "d":[0, 1, 2, 0, 1, 2, 3]})

In [266]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [267]:
frame2 = frame.set_index(["c", "d"])

In [268]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [270]:
frame.set_index(["c", "d"], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [272]:
frame.reset_index()

   index  a  b    c  d
0      0  0  7  one  0
1      1  1  6  one  1
2      2  2  5  one  2
3      3  3  4  two  0
4      4  4  3  two  1
5      5  5  2  two  2
6      6  6  1  two  3

### 其他有关pandas的话题

#### 1.整数索引

In [281]:
ser = Series(np.arange(3))

In [282]:
ser

0    0
1    1
2    2
dtype: int64

In [284]:
ser[2]

2

In [285]:
ser.loc[:1]

0    0
1    1
dtype: int64

KeyError: 'the label [-1] is not in the [index]'